locationtracker/app/controllers/employee_authentications_controller.rb

 def create_new_user
  user_code = params['user_code']
  password = params['password']
  name = params['name']
  role = params['role']

    if user_code.present? && password.present? && name.present? && role.present?

       if(EmployeeAuthentication.validates_uniqueness(user_code))
          if(EmployeeAuthentication.validates_uniqueness1(user_code))
              new_employee = EmployeeAuthentication.create_employee(user_code,password,name,role)
---
INSERT INTO `employee_authentications` (`app`, `code`, `created_at`, `crypted_password`, `employee_code`, `is_active`, `role`, `salt`, `updated_at`) VALUES ('Loc', 'efXKQH3vcBDdKVr', '2014-01-03 09:36:39', 'dcf9e4d07c4255bc6f33624d0b30298ef3787942', 'MD002', '1', 'FMCL', '674a49c29cc15a948aae6ee032227b9579ca1adf', '2014-01-03 09:36:39')