locationtracker/app/controllers/temp_emp_trees_controller.rb

SELECT `employee_authentications`.* FROM `employee_authentications` WHERE `employee_authentications`.`code` = 'cw8kHinCVCnXnmu' LIMIT 1
---
  def temp_table

    # arr = Array.new

     code = params['code']
      if code.present?
            emolpyee_code = EmployeeAuthentication.find(:first , :conditions => {:code => code })