Posmtracker/app/controllers/employees_controller.rb

  def get_images

     count = params['no'].to_i
     is_active = params['is_active'].to_i
     user_code = params['user_code']
      arr = Array.new

         details = EmployeeAuthentication.find(:first , :conditions => {:code => user_code})
---
SELECT `employee_authentications`.* FROM `employee_authentications` WHERE `employee_authentications`.`code` = 'rLXVK56ZERrMqCN' LIMIT 1