Posmtracker/app/controllers/uploaded_images_controller.rb

SELECT `employee_authentications`.* FROM `employee_authentications` WHERE `employee_authentications`.`code` = 'Q9WqbEXXZv4tXKK' LIMIT 1
---
 def store_image
     require "base64"
	require 'RMagick'
      image_64 = params['data']
      emp_id = params['code']
      customer_code = params['customer_code']
      image_date = params['image_date']
      about_text = params['about_text']

          image_date = UploadedImage.date_format12(image_date.to_s)

           # json = {"success" => 0, "message" => image_time11}
           # render :json => json
           # return


       if image_64.present? && emp_id.present? && customer_code.present? && image_date.present? && about_text.present?

          emolpyee_code = EmployeeAuthentication.find(:first , :conditions => {:code => emp_id })